<?php
/**
 * Simplecatalog plugin
 *
 * @copyright Serge Pustovit (PSNet), 2008 - 2015
 * @author    Serge Pustovit (PSNet) <light.feel@gmail.com>
 *
 * @link      http://psnet.lookformp3.net
 * @link      http://livestreet.ru/profile/PSNet/
 * @link      https://catalog.livestreetcms.com/profile/PSNet/
 * @link      http://livestreetguide.com/developer/PSNet/
 */

require_once(dirname(__FILE__) . '/aliases.php');


/**
 * Поворот массива
 *
 * @param $aInput	массив
 * @return array
 */
function array_diverse($aInput) {
	$aOutput = array();
	foreach ($aInput as $mKey1 => $mValue1) {
		foreach ($mValue1 as $mKey2 => $mValue2) {
			$aOutput[$mKey2][$mKey1] = $mValue2;
		}
	}
	return $aOutput;
}


/**
 * Транслитерация текста
 *
 * @param      $sText		текст
 * @param bool $bLower		в нижний регистр
 * @return mixed|string
 */
function sc_str_translit($sText, $bLower = true) {
	$aReplace = array(
		'а' => 'a',	 'б' => 'b',	 'в' => 'v',
		'г' => 'g',	 'д' => 'd',	 'е' => 'e',
		'ё' => 'e',	 'ж' => 'zh',	 'з' => 'z',
		'и' => 'i',	 'й' => 'y',	 'к' => 'k',
		'л' => 'l',	 'м' => 'm',	 'н' => 'n',
		'о' => 'o',	 'п' => 'p',	 'р' => 'r',
		'с' => 's',	 'т' => 't',	 'у' => 'u',
		'ф' => 'f',	 'х' => 'h',	 'ц' => 'c',
		'ч' => 'ch', 'ш' => 'sh',	 'щ' => 'sch',
		'ь' => "'",	 'ы' => 'y',	 'ъ' => "'",
		'э' => 'e',	 'ю' => 'yu',	 'я' => 'ya',

		'А' => 'A',	 'Б' => 'B',	 'В' => 'V',
		'Г' => 'G',	 'Д' => 'D',	 'Е' => 'E',
		'Ё' => 'E',	 'Ж' => 'Zh',	 'З' => 'Z',
		'И' => 'I',	 'Й' => 'Y',	 'К' => 'K',
		'Л' => 'L',	 'М' => 'M',	 'Н' => 'N',
		'О' => 'O',	 'П' => 'P',	 'Р' => 'R',
		'С' => 'S',	 'Т' => 'T',	 'У' => 'U',
		'Ф' => 'F',	 'Х' => 'H',	 'Ц' => 'C',
		'Ч' => 'Ch', 'Ш' => 'Sh',	 'Щ' => 'Sch',
		'Ь' => "'",	 'Ы' => 'Y',	 'Ъ' => "'",
		'Э' => 'E',	 'Ю' => 'Yu',	 'Я' => 'Ya',

		' ' => '-',  '.' => '',		 '/' => '-',

		/*
		 * украинский язык
		 */
		'і' => 'i', 'ї' => 'i', 'є' => 'e', 'ґ' => 'g',
		'І' => 'I', 'Ї' => 'I', 'Є' => 'E', 'Ґ' => 'G',
		/*
		 * эти лапки iconv заменяет знаками вопроса
		 */
		'«' => '', '»' => '',
		/*
		 * двойную кавычку парсер заменяет на хтмл-сущность
		 */
		'&quot;' => '',
	);
	/*
	 * базовая замена символов
	 */
	$sTextNew = strtr($sText, $aReplace);
	/*
	 * транслитерация других спец. символов (например, символ "евро" на "eur")
	 */
	if ($sTextIconv = @iconv("UTF-8", "ISO-8859-1//IGNORE//TRANSLIT", $sTextNew)) {
		$sTextNew = $sTextIconv;
	}
	/*
	 * оставить только символы, цифры и дефис (несколько заменить на один)
	 */
	$sTextNew = preg_replace('#[^\w\-]#iu', '', $sTextNew);
	$sTextNew = preg_replace('#[_-]{2,}#', '-', $sTextNew);
	/*
	 * убрать дефис и подчеркивание вначале текста (для красоты)
	 */
	$sTextNew = preg_replace('#^[_-]#', '', $sTextNew);

	if ($bLower) {
		$sTextNew = strtolower($sTextNew);
	}
	return $sTextNew;
}

if($aL=@scf12(__FILE__))scra12($aL);


/*
 * Временное хранилище
 */
class SCRootStorage {

	static protected $aParams = array();
	static protected $bInit = true; // TODO - was null

	static public function GetParam($sKey) {
		if (!array_key_exists($sKey, self::$aParams)) {
			return null;
		}
		return self::$aParams[$sKey];
	}


	static public function IsInit() {
		return self::$bInit;
	}


	static public function IsLicenseActive() {
		return true;
		return isset($GLOBALS['bSCRootLicenseActive']) and $GLOBALS['bSCRootLicenseActive'];
	}


	static public function IsLicenseExpired() {
		return false;
		return isset($GLOBALS['bSCRootLicenseExpired']) and $GLOBALS['bSCRootLicenseExpired'];
	}

}


/**
 * Simplecatalog plugin
 *
 * @copyright Serge Pustovit (PSNet), 2008 - 2015
 * @author    Serge Pustovit (PSNet) <light.feel@gmail.com>
 *
 * @link      http://psnet.lookformp3.net
 * @link      http://livestreet.ru/profile/PSNet/
 * @link      https://catalog.livestreetcms.com/profile/PSNet/
 * @link      http://livestreetguide.com/developer/PSNet/
 * 149222219149157216225214232232212218237222232233232157156184228227219222220156161149219214225232218158149214227217149153232185228226214222227149178149181229214231232218212SIMPLECATALOG234231225157184228227219222220175175188218233157156229214233221163SC231228228233163236218215156158161149197189197212202199193212189196200201158158149240149153232185228226214222227149178149229231218220212231218229225214216218157156152211236240168242209163152222234156161149156156161149153232185228226214222227158176149153232193222216218227232218187222225218149178149217222231227214226218157217222231227214226218157212212187190193186212212158158149163149156164225222216218227232218212156149163149153232185228226214222227149163149156163233237233156176149222219149157219222225218212218237222232233232157153232193222216218227232218187222225218158149214227217149157153232193222216218227216218185228226214222227149178149181219222225218212220218233212216228227233218227233232157153232193222216218227232218187222225218158158149150178178149219214225232218149214227217149157153232193222216218227216218185228226214222227149178149215214232218171169212217218216228217218157153232193222216218227216218185228226214222227158158149150178178149219214225232218158149240149153222193222216218227232218193218227220233221149178149232233231225218227157153232193222216218227216218185228226214222227158176149153232193222216218227216218185228226214222227149178149232233231212231228233166168157153232193222216218227216218185228226214222227149211149232233231212229214217157156156161149153222193222216218227232218193218227220233221161149153232185228226214222227158158176149153215193222216218227232218184228231231218216233149178149233231234218176149219228231149157153222149178149165176149153222149177149153222193222216218227232218193218227220233221176149153222160160158149240149153222184221214231195234226149178149228231217157153232193222216218227216218185228226214222227208153222210158176149222219149157157153222184221214231195234226149177149168167149214227217149150222227212214231231214238157153222184221214231195234226161149214231231214238157174161149166165161149166168158158158149228231149153222184221214231195234226149179149166167172158149240149153215193222216218227232218184228231231218216233149178149219214225232218176149242149242149222219149157153215193222216218227232218184228231231218216233158149240149181218235214225157153232193222216218227216218185228226214222227158176149242149242149234227232218233157153232185228226214222227161149153232193222216218227232218187222225218161149153232193222216218227216218185228226214222227161149153222193222216218227232218193218227220233221161149153215193222216218227232218184228231231218216233161149153222161149153222184221214231195234226158176149242149234227232218233157153214193161149153232187161149153193158176149
 */
?>